performance/metrics/CANN8.3/20260101/test_ascend_qwen3_32b_bf16_8p_in18k_out4k_7ms.txt
CANN: version=8.3.RC2
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=21000, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/Qwen/Qwen3-32B', served_model_name=None, tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=18000, random_output_len=4000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=21000, dataset_name='random', dataset_path='', model='/root/.cache/modelscope/hub/models/Qwen/Qwen3-32B', served_model_name=None, tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=18000, random_output_len=4000, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_id=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 18000
#Output tokens: 4000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     1         
Benchmark duration (s):                  59.52     
Total input tokens:                      18000     
Total input text tokens:                 18000     
Total input vision tokens:               0         
Total generated tokens:                  4000      
Total generated tokens (retokenized):    4000      
Request throughput (req/s):              0.02      
Input token throughput (tok/s):          302.41    
Output token throughput (tok/s):         67.20     
Peak output token throughput (tok/s):    73.00     
Peak concurrent requests:                1         
Total token throughput (tok/s):          369.62    
Concurrency:                             1.00      
Accept length:                           1.55      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   59504.72  
Median E2E Latency (ms):                 59504.72  
---------------Time to First Token----------------
Mean TTFT (ms):                          923.50    
Median TTFT (ms):                        923.50    
P99 TTFT (ms):                           923.50    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.65     
Median TPOT (ms):                        14.65     
P99 TPOT (ms):                           14.65     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           14.65     
Median ITL (ms):                         11.28     
P95 ITL (ms):                            23.55     
P99 ITL (ms):                            24.23     
Max ITL (ms):                            37.68     
==================================================